Revit 2027 API
ChangeType.Contains Method
 Checks whether this ChangeType contains the input ChangeType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	ChangeType changeType
)
Public Function Contains (
	changeType As ChangeType
) As Boolean
public:
bool Contains(
	ChangeType^ changeType
)
member Contains :
        changeType : ChangeType -> bool
Parameters
changeType ChangeType
Return Value
Boolean
 True if input changeType is contained by this ChangeType
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ChangeType Class
Autodesk.Revit.DB Namespace